#include <iostream>   //Подключение библиотеки ввода/вывода
#include <string>
using namespace std; //Использование пространства имен, для упрощения кода

int main() //Основаная функция программы
{  //открывающая скобка функции
    //////////////////////////////////////////////////////
    setlocale(LC_ALL, "Rus"); //кодировка русских символов
    cout << "Задание 1\n";
    cout << "First string\n";  //вывод строки в консоль
    cout << "Первая строка\nВторая строка\n"; //вывод строки в коносль с переносом строки
    cout << "Спецсимволы \\\n"; //вывод спецсимвола
    //////////////////////////////////////////////////////
    cout << " \nЗадание 2\n";
    int a = 150;
    float b = 15.933;
    short c = 250;
    cout << "a = " << a << "\n" << "b = " << b << "\n" << "c = " << c << "\n";
    short day = 14;
    string month = "Февраля";
    short year = 2006;
    cout << "Моя дата рождения: " << day << " " << month << " " << year << " года\n";
    const float d = { 2.3 };
    const string e = { "WINDOWS" };
    cout << d << " " << e;


} //закрывающая скобка функции
