#include "Route.h"

// ======================================================
// Конструктор
// ======================================================

Route::Route(string start, string end, double len) {

    startPoint = start;
    endPoint = end;
    length = len;
}

// ======================================================
// Получение длины
// ======================================================

double Route::getLength() const {

    return length;
}

// ======================================================
// Вывод информации
// ======================================================

void Route::printInfo() const {

    cout << "Маршрут: "
        << startPoint
        << " -> "
        << endPoint
        << endl;

    cout << "Длина: "
        << length
        << " км"
        << endl;
}